package com.example.lance.rxjavatest.model.bean;

/**
 * author: Lance
 * time: 2016/2/26 17:59
 * e-mail: lance.cao@anarry.com
 */


public class CityListInfo {
    /**
     * errNum : 0
     * retData : {"citylist":"普洱,海西州,大兴安岭地区,伊春,朝阳,阿坝州,秦皇岛,廊坊,沧州,莱芜,牡丹江,齐齐哈尔,玉树州,双鸭山,滨州,绥化,抚顺,赤峰,黑河,天津,通化,怒江州,宿迁,寿光,莱州,七台河,淄博,榆林,乌兰察布,唐山,山南地区,邯郸,张家口,玉林,鄂尔多斯,即墨,鸡西,胶州,保定,林芝地区,阳泉,衡水,白城,大庆,威海,兴安盟,葫芦岛,庆阳,昌都地区,莱西,文登,迪庆州,临沂,烟台,荣成,海北州,呼伦贝尔,聊城,佳木斯,济宁,平凉,通辽,瓦房店,西双版纳州,延边州,阜新,吉林,本溪,平度,鹤岗,连云港,亳州,大连,丹东,潍坊,辽源,甘南州,白山,东营,塔城地区,深圳,大理州,锡林郭勒盟,青岛,玉溪,招远,蓬莱,北京,承德,松原,哈尔滨,锦州,鹤壁,德宏州,凉山州,胶南,临沧,楚雄州,铜川,枣庄,长春,清远,沈阳,汕尾,舟山,乳山,昆明,海口,安阳,丽江,太原,淮安,三亚,广州,海南州,盐城,德州,铁岭,阳江,日照,濮阳,黔西南州,晋中,泰安,来宾,贺州,湛江,临汾,拉萨,菏泽,云浮,咸阳,章丘,长沙,晋城,伊犁哈萨克州,运城,焦作,济南,呼和浩特,肇庆,甘孜州,六安,吕梁,辽阳,东莞,中山,常德,武威,佛山,新乡,营口,保山,西安,惠州,商洛,石家庄,珠海,梅州,防城港,岳阳,商丘,益阳,南平,池州,安顺,邢台,汕头,蚌埠,徐州,阿勒泰地区,洛阳,盘锦,百色,长治,南通,铜仁地区,鞍山,太仓,江门,扬州,梧州,河源,龙岩,延安,攀枝花,包头,揭阳,巴彦淖尔,四平,宁波,果洛州,潮州,淮南,宝鸡,宣城,襄阳,崇左,阿拉善盟,张掖,石嘴山,娄底,南昌,郴州,汉中,中卫,海门,张家港,克拉玛依,芜湖,渭南,上海,北海,黔东南州,韶关,句容,邵阳,曲靖,黄南州,河池,朔州,吴忠,黔南州,昆山,金坛,嘉峪关,赣州,孝感,周口,抚州,永州,巴中,毕节,安康,驻马店,吉安,阜阳,兰州,常熟,常州,开封,三明,昭通,张家界,柳州,嘉兴,茂名,那曲地区,新余,衢州,许昌,临夏州,厦门,江阴,漳州,湘潭,钦州,银川,郑州,大同,溧阳,三门峡,鹰潭,恩施州,滁州,乌海,天水,义乌,雅安,镇江,文山州,漯河,咸宁,泰州,铜陵,阿克苏地区,武汉,杭州,贵港,宜兴,吴江,泉州,丽水,忻州,株洲,黄山,贵阳,淮北,荆州,南宁,内江,台州,遵义,富阳,萍乡,无锡,桂林,苏州,平顶山,南阳,湘西州,上饶,临安,宜昌,湖州,宜宾,马鞍山,白银,西宁,绍兴,九江,十堰,衡阳,荆门,重庆,达州,南京,泸州,定西,福州,博州,信阳,宁德,固原,日喀则地区,阿里地区,遂宁,酒泉,怀化,金华,宿州,乐山,莆田,和田地区,南充,黄冈,宜春,合肥,资阳,广安,景德镇,随州,成都,绵阳,安庆,哈密地区,克州,六盘水,海东地区,温州,红河州,德阳,黄石,广元,眉山,鄂州,吐鲁番地区,陇南,自贡,金昌,昌吉州,喀什地区,乌鲁木齐,库尔勒,石河子,五家渠,"}
     * retMsg : success
     */

    private int errNum;
    /**
     * citylist : 普洱,海西州,大兴安岭地区,伊春,朝阳,阿坝州,秦皇岛,廊坊,沧州,莱芜,牡丹江,齐齐哈尔,玉树州,双鸭山,滨州,绥化,抚顺,赤峰,黑河,天津,通化,怒江州,宿迁,寿光,莱州,七台河,淄博,榆林,乌兰察布,唐山,山南地区,邯郸,张家口,玉林,鄂尔多斯,即墨,鸡西,胶州,保定,林芝地区,阳泉,衡水,白城,大庆,威海,兴安盟,葫芦岛,庆阳,昌都地区,莱西,文登,迪庆州,临沂,烟台,荣成,海北州,呼伦贝尔,聊城,佳木斯,济宁,平凉,通辽,瓦房店,西双版纳州,延边州,阜新,吉林,本溪,平度,鹤岗,连云港,亳州,大连,丹东,潍坊,辽源,甘南州,白山,东营,塔城地区,深圳,大理州,锡林郭勒盟,青岛,玉溪,招远,蓬莱,北京,承德,松原,哈尔滨,锦州,鹤壁,德宏州,凉山州,胶南,临沧,楚雄州,铜川,枣庄,长春,清远,沈阳,汕尾,舟山,乳山,昆明,海口,安阳,丽江,太原,淮安,三亚,广州,海南州,盐城,德州,铁岭,阳江,日照,濮阳,黔西南州,晋中,泰安,来宾,贺州,湛江,临汾,拉萨,菏泽,云浮,咸阳,章丘,长沙,晋城,伊犁哈萨克州,运城,焦作,济南,呼和浩特,肇庆,甘孜州,六安,吕梁,辽阳,东莞,中山,常德,武威,佛山,新乡,营口,保山,西安,惠州,商洛,石家庄,珠海,梅州,防城港,岳阳,商丘,益阳,南平,池州,安顺,邢台,汕头,蚌埠,徐州,阿勒泰地区,洛阳,盘锦,百色,长治,南通,铜仁地区,鞍山,太仓,江门,扬州,梧州,河源,龙岩,延安,攀枝花,包头,揭阳,巴彦淖尔,四平,宁波,果洛州,潮州,淮南,宝鸡,宣城,襄阳,崇左,阿拉善盟,张掖,石嘴山,娄底,南昌,郴州,汉中,中卫,海门,张家港,克拉玛依,芜湖,渭南,上海,北海,黔东南州,韶关,句容,邵阳,曲靖,黄南州,河池,朔州,吴忠,黔南州,昆山,金坛,嘉峪关,赣州,孝感,周口,抚州,永州,巴中,毕节,安康,驻马店,吉安,阜阳,兰州,常熟,常州,开封,三明,昭通,张家界,柳州,嘉兴,茂名,那曲地区,新余,衢州,许昌,临夏州,厦门,江阴,漳州,湘潭,钦州,银川,郑州,大同,溧阳,三门峡,鹰潭,恩施州,滁州,乌海,天水,义乌,雅安,镇江,文山州,漯河,咸宁,泰州,铜陵,阿克苏地区,武汉,杭州,贵港,宜兴,吴江,泉州,丽水,忻州,株洲,黄山,贵阳,淮北,荆州,南宁,内江,台州,遵义,富阳,萍乡,无锡,桂林,苏州,平顶山,南阳,湘西州,上饶,临安,宜昌,湖州,宜宾,马鞍山,白银,西宁,绍兴,九江,十堰,衡阳,荆门,重庆,达州,南京,泸州,定西,福州,博州,信阳,宁德,固原,日喀则地区,阿里地区,遂宁,酒泉,怀化,金华,宿州,乐山,莆田,和田地区,南充,黄冈,宜春,合肥,资阳,广安,景德镇,随州,成都,绵阳,安庆,哈密地区,克州,六盘水,海东地区,温州,红河州,德阳,黄石,广元,眉山,鄂州,吐鲁番地区,陇南,自贡,金昌,昌吉州,喀什地区,乌鲁木齐,库尔勒,石河子,五家渠,
     */

    private RetDataEntity retData;
    private String retMsg;

    public void setErrNum(int errNum) {
        this.errNum = errNum;
    }

    public void setRetData(RetDataEntity retData) {
        this.retData = retData;
    }

    public void setRetMsg(String retMsg) {
        this.retMsg = retMsg;
    }

    public int getErrNum() {
        return errNum;
    }

    public RetDataEntity getRetData() {
        return retData;
    }

    public String getRetMsg() {
        return retMsg;
    }

    public static class RetDataEntity {
        private String citylist;

        public void setCitylist(String citylist) {
            this.citylist = citylist;
        }

        public String getCitylist() {
            return citylist;
        }
    }
}
